{"page.state":{"announcement_bar":{},"title":"Turn your Angular App Native","description":"Any Angular app can be turned into a native app with Capacitor","slug":"turn-your-angular-app-native","date":"2020-08-17T08:00:00.000Z","authorName":"Max Lynch","authorUrl":"https://twitter.com/maxlynch","html":"<p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3 paragraph-intro\">Angular is used to build seriously large applications, but did you know you can target iOS and Android (and PWA) from your codebase without many changes to your existing Angular app?</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3 paragraph-intro\">With Capacitor, any Angular app can be turned into an iOS and Android app with full access to native APIs and OS controls. Capacitor does this by providing a native runtime for web apps with a bridge to communicate from the web app to the native layer, along with many <a href=\"https://capacitorjs.jp/docs/apis\">Native APIs</a> and access to hundreds more from the community.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3 paragraph-intro\">Perhaps a surprise to many Angular developers, Angular is already used to power a significant number of app store apps (<a href=\"https://appfigures.com/top-sdks/development/apps\">at least 15%</a>). This is because <a href=\"https://ionicframework.com/\">Ionic Framework</a> has been widely used as a mobile UI framework for Angular since the AngularJS days and many Cordova apps used Angular over the years.</p>  <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"is-this-like-cordova\"><a href=\"#is-this-like-cordova\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Is this like Cordova?</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor is similar to Cordova (and Electron, for that matter) in that it runs a web app in a native environment and adds Native API access to the web app.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Compared to Cordova, Capacitor is a relatively new, ground up effort to build a modern native mobile runtime for cross-platform iOS, Android, and PWA apps. Capacitor was built by the team behind <a href=\"https://ionicframework.com/\">Ionic Framework</a> to provide an alternative to Cordova for this native runtime layer. You can read more about the <a href=\"https://capacitorjs.jp/docs/cordova\">motivation for creating Capacitor</a> on the docs.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor has backwards compatibility with many Cordova plugins so migration is <a href=\"https://capacitorjs.jp/cordova\">straightforward</a>.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"how-is-this-different-from-ionic-framework\"><a href=\"#how-is-this-different-from-ionic-framework\" class=\"heading-anchor\" aria-hidden=\"true\"></a>How is this different from Ionic Framework?</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor and Ionic Framework is like comparing Apples to Oranges.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor (like Cordova), provides a native runtime for web apps across multiple platforms. It’s the part of your app that supports adding native code and plugins, and manages communication between a web app running in a web view, and the operating system below. Think of Capacitor like Electron but for Mobile (though Capacitor and Electron are very different and Capacitor can be much more efficient, so doesn’t have the downsides of Electron). Thus, Capacitor simply provides an empty web frame and extra mobile APIs, it still needs you to provide a UI for the app.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">In contrast, Ionic Framework is a mobile-focused UI library for web apps. Think of Ionic Framework like Bootstrap or Material. Ionic Framework provides iOS and Android specific UI controls and experiences such as navigation/transitions, modals, buttons, form controls, swipeable items, and a ton more.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">So, your mobile web app will use Capacitor to target iOS and Android (and PWA), and use a UI library like Ionic Framework to provide the mobile experience users expect.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor does not require Ionic Framework (though it’s certainly one of the very best options), so Capacitor can work with any popular web-based UI library.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"how-does-this-compare-to-react-native-or-nativescript\"><a href=\"#how-does-this-compare-to-react-native-or-nativescript\" class=\"heading-anchor\" aria-hidden=\"true\"></a>How does this compare to React Native or NativeScript?</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">NativeScript and React Native are two popular mobile app frameworks that enable developers to build native apps using JavaScript.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">The biggest difference between Capacitor and these other options is that Capacitor uses standard web development technology, tooling, and developer experience. This means Capacitor can turn <em>any web app</em> into a native app. React Native and NativeScript, in contrast, are frameworks that must be targeted from the beginning of an app’s code base and provide a “web like” experience that is not a true browser environment.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">This has some advantages in that system controls are used exclusively, but in this case it’s important to remember that these solutions will not enable you to take an existing Angular app, or one built with popular Angular libraries like Angular Material or Ionic Framework, and deploy it to the App Store. Instead, your app would need to be written from the ground up to use them and web libraries would not be compatible.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor, in contrast, supports any app that runs in the browser and provides a true web development experience.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"whos-using-capacitor\"><a href=\"#whos-using-capacitor\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Who’s using Capacitor?</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor is widely used in startups and the Fortune 1000. Companies like RBI (Burger King/Popeyes), Blue Cross Blue Shield, Aflac, and IBM are all using Capacitor to target iOS and Android with their web development teams.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor is backed by <a href=\"https://ionic.io/\">Ionic</a>, the leader in cross-platform mobile development. Ionic provides <a href=\"https://ionicframework.com/native\">enterprise security features and support</a> for teams that need more than what’s available in the community version.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"get-started\"><a href=\"#get-started\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Get Started</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">To get started building iOS, Android, and Progressive Web Apps take a look at the <a href=\"https://capacitorjs.com/solution/angular\">Angular Getting Started</a> guide or follow the standard <a href=\"https://capacitorjs.com/docs/getting-started\">Getting Started</a> experience.</p>"},"components":["announcement-bar","site-backdrop","docs-dropdown","blog-subnav","blog-post","ion-icon","docs-search","more-button","site-header","site-root","capacitor-site"]}