{"page.state":{"announcement_bar":{},"title":"How Capacitor Works","description":"How does Capacitor, a cross-platform native runtime for web apps, work on the inside?","slug":"how-capacitor-works","date":"2020-08-13T08:00:00.000Z","authorName":"Max Lynch","authorUrl":"https://twitter.com/maxlynch","html":"<p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3 paragraph-intro\">Capacitor is a cross-platform native runtime for Web Native apps.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3 paragraph-intro\">At a high level, that means Capacitor takes a modern web app, and then packages it up to run on iOS, Android, and PWA with access to native platform features and OS-level controls.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3 paragraph-intro\">Capacitor then acts as the <em>runtime</em> facilitating communication between the web app and the underlying OS.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3 paragraph-intro\">Let’s dig in and explore how Capacitor works under the hood.</p>  <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"the-basics\"><a href=\"#the-basics\" class=\"heading-anchor\" aria-hidden=\"true\"></a>The basics</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">At a high level, Capacitor does this:</p> <img src=\"/assets/img/blog/how-capacitor-works/basic.png\" alt=\"Basic Capacitor Diagram\"> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">But that’s pretty simplistic, if we zoom in a bit and bring in your app code, we see that Capacitor is made up of a few individual components:</p> <img src=\"/assets/img/blog/how-capacitor-works/zoomed.png\" alt=\"Zoomed Capacitor App\"> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">In this diagram, we see that your web app runs inside of a Web View. A Web View is a native OS control that provides a streamlined, chrome-less browser instance. If you imagine a typical web browser, a ton of overhead comes from the chrome and experience around the actual browsing frame. A Web View is just one instance of that browsing frame, so it’s very light weight.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Most of the magic happens in the Native Bridge and the Runtime, so let’s explore those:</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"native-bridge\"><a href=\"#native-bridge\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Native Bridge</h2><img src=\"/assets/img/blog/how-capacitor-works/bridge.png\" alt=\"Bridge\"> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">That Web View needs a way to access native functionality, interact with OS level native controls, and access custom native code or 3rd party plugins. It does that using the Native Bridge inside of Capacitor.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">The Native Bridge is where Capacitor’s <em>runtime</em> JS API, including all known native plugins and their methods, are exported to the Web View. The runtime API is different from the <code>@capacitor/core</code> API that is imported directly into your web app, but they work together to enable Capacitor APIs to work across all supported platforms.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor loads all known plugins that have been installed or coded directly into the native project, and then exports <code>window.Capacitor.Plugins</code> containing every loaded plugin and every known method that plugin has exported to the Web View.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Finally, the bridge manages message passing and tracking native invocations between the Web View and the native runtime.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"runtime\"><a href=\"#runtime\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Runtime</h2><img src=\"/assets/img/blog/how-capacitor-works/runtime.png\" alt=\"Runtime\"> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">The Native runtime is where calls from the Web View get routed to native plugins and custom native code.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">When the app first starts, the runtime loads any installed plugins and custom native plugins. The runtime also initializes the Web View and injects the JavaScript Symbols for all known plugins into the Web View.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">When plugins are invoked, the runtime processes each invocation as a message, constructs a method call to the corresponding plugin, and executes it.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">All calls in Capacitor are asynchronous, so the runtime manages a set of “active” calls that have yet to be completed. These calls might be as simple as calling a Native API, or as complicated as opening an intent and processing the result of another app (such as the Camera on Android).</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Once those calls complete, a message is constructed and sent back to the Web View, which ultimately causes the original plugin call in your app to resolve.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"capacitor-apps-are-native\"><a href=\"#capacitor-apps-are-native\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Capacitor apps are native</h2><img src=\"/assets/img/blog/how-capacitor-works/native.png\" alt=\"Native\"> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor works by extending a Web View with additional functionality and indirect access to full native functionality through plugins and custom native code.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor apps <em>are native apps</em>. The project files used to build the native iOS and Android binaries is a plain iOS app for Xcode and a plain Android app using Gradle. This means teams can add arbitrary native code to the app and invoke it from the Web View through the Capacitor Plugin API. If you’d like to explore this in detail, read how <a href=\"https://medium.com/@maxlynch/cordova-ionic-apps-are-native-apps-64f9e1a995d9\">Capacitor Apps are Native Apps</a>.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">In the diagram above, the native project contains our built web assets which will be some kind of modern JS app that is built and copied to the native project. That modern JS app imports the <code>@capacitor/core</code> library to code against the JavaScript symbols Capacitor generates at runtime (and to support Web APIs like <a href=\"https://capacitorjs.jp/docs/apis/camera\">Camera</a> or <a href=\"https://capacitorjs.jp/docs/apis/share\">Share</a> for PWAs).</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">During the <code>copy</code> step from the Capacitor CLI tools, the <code>native-bridge.js</code> is copied to the project which contains Capacitor’s message passing bridge on the Web View side.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Finally, any Capacitor plugins or custom native code will be in the project as well, along with any libraries that code requires.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">One note about Progressive Web Apps (PWA): when building a PWA, you simply need to deploy your built web app somewhere to the web. There really is no additional step because the <code>@capacitor/core</code> library contains all the functionality needed for Capacitor plugins that have web support, such as <a href=\"https://capacitorjs.jp/docs/apis/camera\">Camera</a>, <a href=\"https://capacitorjs.jp/docs/apis/filesystem\">Filesystem</a>, or <a href=\"https://capacitorjs.jp/docs/apis/share\">Share</a>.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"conclusion\"><a href=\"#conclusion\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Conclusion</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">Capacitor provides a runtime for Web Apps, so teams typically spend most of their time building their web app, making sure it works well on mobile form factors and has a mobile UI experience that users expect (UI frameworks like <a href=\"https://ionicframework.com/\">Ionic Framework</a> provide this experience out of the box).</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">This is in contrast to many other cross-platform mobile technologies that use native system controls. While there are benefits to doing that, the benefits to using Capacitor are a pure web development experience, truly write once run anywhere, and compatibility with the full web development ecosystem and hiring market.</p>"},"components":["announcement-bar","site-backdrop","docs-dropdown","blog-subnav","blog-post","ion-icon","docs-search","more-button","site-header","site-root","capacitor-site"]}