{"page.state":{"announcement_bar":{},"featuredImage":"/community-adoption/cap-adoption-feature-image.png","title":"Community Adoption of Capacitor","description":"Community Adoption of Capacitor","slug":"community-adoption-of-capacitor","date":"2021-02-18T14:00:00.000Z","authorName":"Mike Hartington","authorUrl":"https://twitter.com/mhartington","featuredImageAlt":"Community Adoption of Capacitor","html":"<p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3 paragraph-intro\">When Capacitor was first created by the Ionic team, our goal was to provide a more streamlined and modern approach to developing cross platform apps for iOS, Android, and the web. By taking advantage of modern native tooling and modern Web Platform features, we knew we could enable developers to build amazing native apps in a way that felt like web development.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3 paragraph-intro\">At first, we intended Capacitor to be a modern tool used by the Ionic community in place of alternatives like Cordova. But more recently, we’ve started to see Capacitor grow way beyond that. In fact, Capacitor is steadily becoming the de facto choice for most web developers building native mobile apps with the web, and a default target for many other web communities outside of the Ionic ecosystem..</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3 paragraph-intro\">This is incredible and really shows how Capacitor is eclipsing even our own modest goals for the project — from popular frontend tools like Tailwind and Vue to alternative mobile UI libraries and more. Here are just a few recent examples:</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"framework7\"><a href=\"#framework7\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Framework7</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\"><a href=\"https://framework7.io\">Framework7</a> is a mobile-ready UI library in the same vein as Ionic. Funny enough, people often compare the two and ask which one is better (as developers are want to do). But Framework7 has a dedicated and passionate community, much like Ionic has. So we were incredibly thrilled to see that with their latest V6 release, they’ve added support for using Capacitor as the native runtime of choice. This means that users of Framework7 can take advantage of all the features Capacitor provides when building native iOS and Android apps and PWAs, while using the tools that Framework7 developers are already familiar with. We’re so happy to see Framework7 adopt Capacitor and welcome them to the community.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"nativescript\"><a href=\"#nativescript\" class=\"heading-anchor\" aria-hidden=\"true\"></a>NativeScript</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">In addition to Framework7, we were also thrilled to see <a href=\"https://capacitor.nativescript.org/\">NativeScript</a> adopt Capacitor in the form of a plugin offering. As they note in <a href=\"https://nativescript.org/blog/announcing-nativescript-capacitor-beta/\">their blog post</a>, one of NativeScript’s features is being able to target Native APIs directly from JavaScript, so plugins can be built entirely in JavaScript. This can become quite a compelling feature if you need to integrate with an obscure 3rd party Native SDK. While still in beta, we’ve been impressed with we’ve and can’t wait to see what the community builds with it.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"quasar\"><a href=\"#quasar\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Quasar</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">For the more Vue-minded folks, <a href=\"https://quasar.dev\">Quasar</a> has fully integrated Capacitor into their toolchain. Similar to Ionic and Framework7, Quasar UI framework for Vue provides common building blocks for building web apps. As of last year, they’ve provided full integration into the Quasar CLI so that making use of Capacitor is a natural fit for their community.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"vue\"><a href=\"#vue\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Vue</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">While Quasar is built on top of <a href=\"https://v3.vuejs.org\">Vue</a>, Vue-proper has also started suggesting <a href=\"https://v3.vuejs.org/guide/mobile.html#capacitor\">Capacitor in their documentation</a>. With this, they’re signaling to their user that “Hey, if you want to take your Vue app further, use Capacitor and target native platforms”. This is something we’ve seen the community respond well too as we hear from so many of you that you want more Vue specific content or example apps.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"tailwind\"><a href=\"#tailwind\" class=\"heading-anchor\" aria-hidden=\"true\"></a>Tailwind</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">If you haven’t heard of <a href=\"https://tailwindcss.com\">Tailwind</a> before, it’s a CSS toolchain for developers that makes scaffolding out common UI patterns a matter of adding a few classes to your markup. We’ve written about <a href=\"https://capacitorjs.com/blog/mobile-apps-with-tailwind-css-nextjs-ionic-and-capacitor\">our experience with it</a> and how Tailwind hit that nice sweet spot of minimalism and power-user features. Increasingly we’ve seen developers excited to use Tailwind with Capacitor and it’s no secret why. The speed at which you can develop your app’s UI and the ease of development Capacitor provides makes for a great pair. Add a bit of React, Angular, or Vue to the mix and you’re able to build some incredible features at record speed. We’re excited to see more folks in the Tailwind community look to Capacitor as their native runtime of choice.</p> <h2 class=\"ui-heading ui-heading-2 ui-theme--editorial\" id=\"to-ze-moon\"><a href=\"#to-ze-moon\" class=\"heading-anchor\" aria-hidden=\"true\"></a>To ze moon!</h2><p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">In a short amount of time, Capacitor has grown from being a tool for Ionic developers to being the de facto way to build cross platform apps across the entire web community. This <a href=\"https://webnative.tech\">Web Native</a> approach to development is here to stay and we’re thrilled to see Capacitor leading the way.</p> <p class=\"ui-paragraph ui-paragraph--prose ui-paragraph-3\">So thanks to the folks behind Framework7, NativeScript, Vue, Quasar, Tailwind, and others for welcoming Capacitor into your own communities. If you’re interested seeing what Capacitor can do, checkout our <a href=\"https://capacitorjs.com/docs\">docs</a>. We’re excited to see what you build 🍻</p>"},"components":["announcement-bar","site-backdrop","docs-dropdown","blog-subnav","blog-post","ion-icon","docs-search","more-button","site-header","site-root","capacitor-site"]}